backend-api/backend-api/app/Controllers/AuthController.php

    public function login()
    {
        $json = $this->request->getJSON();

        if (!$json || empty($json->username) || empty($json->password)) {
            return $this->respond([
                'status'  => 400,
                'message' => 'Username dan password wajib diisi!'
            ], 400);
        }

        $username = trim($json->username);
        $password = $json->password;

        $db   = \Config\Database::connect();
        $user = $db->table('users')->getWhere(['username' => $username])->getRow();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'

    public function logout()
    {
        $authHeader = $this->request->getServer('HTTP_AUTHORIZATION');

        if ($authHeader && preg_match('/Bearer\s(\S+)/', $authHeader, $matches)) {
            $token = $matches[1];

            $db = \Config\Database::connect();
            $db->table('users')->where('token', $token)->update(['token' => null]);
---
UPDATE `users` SET `token` = 'KODETOKENSUPERAMANADMIN'
WHERE `id` = '1'