backend-api/backend-api/app/Controllers/BukuController.php

    public function index()
    {
        // Melakukan JOIN ke tabel kategori untuk mengambil nama kategori genre buku
        $data = $this->model->select('buku.*, kategori.nama_kategori')
                            ->join('kategori', 'kategori.id = buku.kategori_id', 'left')
                            ->findAll();
---
SELECT `buku`.*, `kategori`.`nama_kategori`
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id` = `buku`.`kategori_id`

    public function getPeminjaman()
    {
        $db = \Config\Database::connect();

        // Mengambil log peminjaman dengan data judul buku
        $data = $db->table('peminjaman')
                   ->select('peminjaman.*, buku.judul')
                   ->join('buku', 'buku.id = peminjaman.buku_id', 'left')
                   ->orderBy('tanggal_pinjam', 'DESC')
                   ->get()
                   ->getResultArray();
---
SELECT `peminjaman`.*, `buku`.`judul`
FROM `peminjaman`
LEFT JOIN `buku` ON `buku`.`id` = `peminjaman`.`buku_id`
ORDER BY `tanggal_pinjam` DESC

    public function pinjam()
    {
        $db = \Config\Database::connect();

        $json = $this->request->getJSON();

        $bukuId       = $json->buku_id ?? null;
        $namaPeminjam = $json->nama_peminjam ?? 'Pembaca Umum';

        if (!$bukuId) {
            return $this->fail('ID Buku tidak boleh kosong.', 400);
        }

        $buku = $this->model->find($bukuId);

        if (!$buku || (int)$buku['stok'] <= 0) {
            return $this->fail('Maaf, stok komik ini sudah habis atau tidak ditemukan!', 400);
        }

        $db->transStart();

        $db->table('peminjaman')->insert([
            'buku_id'        => $bukuId,
            'nama_peminjam'  => $namaPeminjam,
            'tanggal_pinjam' => date('Y-m-d'),
            'status'         => 'Dipinjam'
        ]);

        $this->model->update($bukuId, [
            'stok' => (int)$buku['stok'] - 1
        ]);
---
SELECT *
FROM `buku`
WHERE `buku`.`id` = '31'
INSERT INTO `peminjaman` (`buku_id`, `nama_peminjam`, `tanggal_pinjam`, `status`) VALUES ('31', 'Syafira', '2026-06-22', 'Dipinjam')
UPDATE `buku` SET `stok` = 29
WHERE `buku`.`id` IN ('31')

    public function kembalikan($id = null)
    {
        $db = \Config\Database::connect();

        // Cari data transaksi peminjaman berdasarkan ID lognya
        $peminjaman = $db->table('peminjaman')->where('id', $id)->get()->getRowArray();

        if (!$peminjaman) {
            return $this->failNotFound('Data transaksi peminjaman tidak ditemukan.');
        }

        if ($peminjaman['status'] === 'Dikembalikan') {
            return $this->fail('Buku ini tercatat sudah dikembalikan sebelumnya.', 400);
        }

        $db->transStart();

        // 1. Ubah status peminjaman menjadi 'Dikembalikan'
        $db->table('peminjaman')->where('id', $id)->update([
            'status' => 'Dikembalikan'
        ]);

        // 2. Ambil ID Buku, lalu tambahkan stoknya kembali sebanyak 1
        $bukuId = $peminjaman['buku_id'];
        $buku = $this->model->find($bukuId);

        if ($buku) {
            $this->model->update($bukuId, [
                'stok' => (int)$buku['stok'] + 1
            ]);
---
SELECT *
FROM `peminjaman`
WHERE `id` = '4'
UPDATE `peminjaman` SET `status` = 'Dikembalikan'
WHERE `id` = '4'
UPDATE `buku` SET `stok` = 8
WHERE `buku`.`id` IN ('4')